package Insert_table;
import java.sql.*;

public class I_Program
{
	public static void main(String args[])
	{
		Connection con = null;
        Statement stmt = null;
		try{
			Class.forName("com.mysql.cj.jdbc.Driver");
			con = DriverManager.getConnection(
			"jdbc:mysql://192.168.56.102:4567/Leisure_reserve","DBuser","1234");
			stmt = con.createStatement();
			
			StringBuffer sql = new StringBuffer();
			sql.append("insert into Program(P_name, P_date, Address, Time, Price, Information)");
			sql.append("values ('세발 크루즈요트', '2020-07-25', '전남목포시', '14:00:00', 90000, '가족들과 함께하는 요트 체험'),"); 
			sql.append("('김4 크루즈요트', '2020-07-18', '경기김포시', '14:00:00', 100000, '김포에서 크루즈요트를?'),");
			sql.append("('한강 크루즈요트', '2020-07-26', '서울시', '14:00:00', 111000, '한강 크루즈요트 체험'),"); 
			sql.append("('감자 딩기', '2020-07-05', '강원강릉시', '12:00:00', 11000, '동해바다를 보며 딩기~'),");
			sql.append("('감자 카약', '2020-07-05', '강원강릉시', '14:00:00', 10000, '연인과 함께 카~약'),");
			sql.append("('카주 진약', '2020-07-11', '경남진주시', '14:00:00', 9000, '남강을 타고 흐르는 카약 체험'),");
			sql.append("('마 카약타러가자', '2020-07-11', '경북상주시', '13:00:00', 8000, '상남자가 좋아하는 카와 약'),");
			sql.append("('상주는 카약', '2020-07-12', '경북상주시', '15:00:00', 7000, '상주에서는 카약이 상줌'),");
			sql.append("('광안대교와 카약을', '2020-07-28', '부산시', '13:00:00', 10000, '뷰와 함께하는 카약'),");
			sql.append("('대프리카약', '2020-07-31', '대구시', '15:00:00', 9000, '대프리카 피서는 카약아이가'),");
			sql.append("('열린 카약', '2020-07-26', '충남보령시', '13:00:00', 10000, '열린바다로에서 카약타자'),");
			sql.append("('녹차엔 카약', '2020-07-25', '전남보성군', '13:00:00', 10000, '녹차먹고 카약'),");
			sql.append("('송카약도', '2020-07-17', '부산시', '13:00:00', 12000, '송일국과 함께하는 카약'),");
			sql.append("('수영강 카약', '2020-07-26', '부산시', '13:00:00', 9900, '수영도 하고 카약도 타고'),");
			sql.append("('세가지맛 카약', '2020-07-26', '부산시', '14:00:00', 10000, '카약의 세가지 즐거움즐겨요'),");
			sql.append("('카약이로구나', '2020-07-12', '세종시', '12:00:00', 10000, '세종대왕님의 카약'),");
			sql.append("('울산바위 카약', '2020-07-20', '울산시', '13:00:00', 11000, '바위처럼 단단한 카약'),");
			sql.append("('사람인 카약천', '2020-07-23', '인천시', '13:00:00', 10000, '카약으로 인천을 즐겨요'),");
			sql.append("('EXPO 카약', '2020-07-07', '전남여수시', '12:00:00', 8000, '카약이 거시기혀'),");
			sql.append("('내가 탄 카약', '2020-07-13', '충북충주시', '14:00:00', 9000, '아부지 카약타러가유'),");
			sql.append("('감자고무보트', '2020-07-01', '강원강릉시', '12:00:00', 40000, '다같이 즐기는 고무보트'),");
			sql.append("('상주는 고무보트', '2020-07-11', '경북상주시', '13:00:00', 45000, '상주에서는 고무보트가 상줌'),");
			sql.append("('대프리카고무보트', '2020-07-22', '대구시', '14:00:00', 50000, '대프리카 피서는 고무보트아이가'),");
			sql.append("('녹차엔 고무보트', '2020-07-25', '전남보성군', '13:00:00', 49000, '녹차먹고 고무보트'),");
			sql.append("('송고무보트도', '2020-07-17', '부산시', '12:00:00', 47000, '송일국과 함께하는 고무보트'),");
			sql.append("('고무엄하도다보트', '2020-07-12', '세종시', '12:00:00', 52000, '세종대왕님의 고무보트'),");
			sql.append("('울산바위 고무보트', '2020-07-21', '울산시', '13:00:00', 50000, '바위처럼 단단한 고무보트'),");
			sql.append("('사람인 고무보트천', '2020-07-23', '인천시', '13:00:00', 49000, '고무보트로 인천을 즐겨요'),");
			sql.append("('내가 탄 고무보트', '2020-07-13', '충북충주시', '14:00:00', 51000, '아부지 고무보트타러가유'),");
			sql.append("('한강 고무보트', '2020-07-25', '서울시', '14:00:00', 60000, '한강 고무보트 체험'),");
			sql.append("('상주는 패들보드', '2020-07-12', '경북상주시', '13:00:00', 9000, '상주에서는 패들보드가 상줌'),");
			sql.append("('대프리카패들보드', '2020-07-31', '대구시', '15:00:00', 8000, '대프리카 피서는 패들보드아이가'),");
			sql.append("('녹차엔 패들보드', '2020-07-25', '전남보성군', '13:00:00', 9900, '녹차먹고 패들보드'),");
			sql.append("('울산바위 패들보드', '2020-07-21', '울산시', '13:00:00', 8000, '바위처럼 단단한 패들보드'),");
			sql.append("('내가 탄 패들보드', '2020-07-13', '충북충주시', '14:00:00', 9000, '아부지 패들보드타러가유'),");
			sql.append("('상주는 수상자전거', '2020-07-12', '경북상주시', '13:00:00', 18000, '상주에서는 수상자전거가 상줌'),");
			sql.append("('수라상자전거', '2020-07-12', '세종시', '12:00:00', 20000, '세종대왕님의 수상자전거'),");
			sql.append("('사람인 수상자전거천', '2020-07-22', '인천시', '15:00:00', 19900, '수상자전거로 인천을 즐겨요'),");
			sql.append("('수영강 바이킹보트', '2020-07-14', '부산시', '14:00:00', 80000, '수영도 하고 바이킹보트도 타고'),");
			sql.append("('사람인 모터보트천', '2020-07-05', '인천시', '12:00:00', 11000, '모터보트로 인천을 즐겨요')");
			
			
			stmt.executeUpdate(sql.toString());
			con.close();
		}catch(Exception e){ System.out.println(e);}
	}
}